[
    {
        "Last_committed_epoch": 1231,
        "Proposal": [
            {
                "id": 29,
                "Type": "PGF funding",
                "Author": "tnam1qztdx4y7a3wn0qmgcgtrty237vcnp9f9hs3rt3k7",
                "Content": {
  "abstract": "Proposing a one-year, cPGF validator subsidy to support 166 active validators.\nThe goal is to extend operator runway, sustain diversity, and prepare for a more targeted meritocratic reward model.",
  "authors": "Gavin Birch (Luminara)",
  "created": "2025-07-25T23:51:00.000Z",
  "details": "This is a Continuous Public Goods Funding (cPGF) proposal to use ~0.67% of the annual PGF budget to allocate NAM to the current active set of Namada validators for year. If approved, **every epoch, 30.1369863 NAM** will be allocated to each tnam address of the **166 active validators**. Assuming this set of cPGF token \"streams\" will end in one year, the **total amount of NAM per validator will be 44,000 NAM**.\n\n#### Notes\n1. While this is part of the PGF budget, the PGF budget does not inflate the NAM supply until it is allocated. If approved, this will introduce 0.67% supply inflation over the year.\n2. There is [not yet a built-in way to end cPGF](https://github.com/namada-net/namada/issues/4104), so a follow-up PGF proposal will be needed to stop this cPGF after one year; exact date to be determined at proposal launch.\n\n#### Recipient List\nhttps://github.com/Luminara-Hub/govproposals/commit/9f2f88579aa96572e5414b560cb1e96a92eb9169\n\n(Github because the list exceeds governance proposal limit) \n\n#### Exclusions\n- Unit 410 [2]\ttnam1q9vnysn3jj9l3rnucr0zt4jpuy224wdl7c0gezrj\n- Shutdown 1st july — Please Redelegate\ttnam1qyj7mwkpc9tg4mljg76wxshwq2rxlskx7c0tlx4c\n- ValidityOps#2\ttnam1q98jzz306gldxvtg5quwnej4zvna6pgnquk2t4dc\n- [ZKV](https://x.com/zkv_xyz/status/1943628922362503411)\ttnam1qxr8n7u36jcf82d0ccp0flshpwhz3d3xjv5ryn44\n- EquinoxDao (jailed > 10 days)\ttnam1q9zemh43mx2dwtlsrfgjanzzut3j5lepaq7uacug\n- Infraspear (jailed > 10 days)\ttnam1qx03fx58wtm6e2g5yt4uu9jpy702h4pjuy9a7653\n\n\n## Context\nMost staking inflation (~95%) goes to passive delegators, versus active validators with immediate operating costs.\n\nWe have a relatively large, diverse set of validators. Namada doesn't need to ensure a particularly large set of validators, but it would be helpful to have more time to continue to enable, surface and reward high-value-add validators so that they remain active. \n\nDirect support is a much more capital-efficient way to increase validator operator runway than by increasing staking inflation. The goal is to extend operator runway to sustain diversity in preparation for a more targeted, meritocratic rewards model.\n\n## Future\nIf this proposal passes, there should be a proposal to end this subsidy after one year (Luminara intends to do this). There may also be intermediary proposal(s) to remove subsidies from inactive validators.\n\nAs a community, Namada should always be improving our collective ability to effectively target and reward active, value-add participants to sustain Namada's roadmap and mission-momentum.",
  "discussions-to": "https://forum.namada.net/t/namada-validator-cpgf-1-year-subsidy-0-67-inflation/1819",
  "motivation": "Sustain the current validator set to surface and reward high-value-add validators.",
  "requires": "0",
  "title": "cPGF - Namada Validator 1-Year Subsidy - 0.67% inflation"
},
                "Start_Epoch": "955",
                "End_Epoch": "979",
                "Activation_Epoch": "980",
                "Status": "ended",
                "Data": ""
            }
        ]
    }
]
